In [1]:
import pandas as pd

df=pd.read_csv(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\data.csv") 
df

      Fname     Lname  Age          City Occupation  Salary
0    Sophia       Lee   22      New York      Pilot   76121
1     James    Taylor   58      Columbus     Doctor   30977
2      Jack    Garcia   56        Dallas  Scientist   39683
3     Isaac    Martin   30        Austin  Architect   75545
4      Noah    Taylor   30      New York  Architect   60659
..      ...       ...  ...           ...        ...     ...
105   Grace    Miller   50       Seattle     Doctor   40175
106  Hannah  Anderson   34  Philadelphia      Pilot   61504
107   Frank     Brown   47  Philadelphia    Teacher   98922
108   Lucas       Lee   27   Los Angeles     Artist   95970
109  Oliver   Johnson   38  Indianapolis  Scientist   76965

[110 rows x 6 columns]

In [9]:
df["Age_Group"]=df['Age'].apply(lambda x: "Group(20-30)" if x in range(20,31) else
                                "Group(31-40)" if x in range(31,41) else
                                "Group(41-50)" if x in range(41,51) else
                                "Group(51-60)" if x in range(51,61) else
                                "Other"
                               )

In [3]:
df.groupby(["City",'Occupation'])['Salary'].sum()

City      Occupation
Austin    Architect     149543
          Artist         48063
          Doctor         71811
          Journalist     50180
          Lawyer        102387
                         ...
San Jose  Teacher        79157
Seattle   Doctor        139902
          Engineer       51851
          Lawyer        183932
          Scientist      61562
Name: Salary, Length: 83, dtype: int64

In [6]:
df.pivot_table(index='City',
              values='Salary',
                columns='Occupation',
               aggfunc='sum'             
              )

Occupation,Accountant,Architect,Artist,Doctor,Engineer,Journalist,Lawyer,Pilot,Scientist,Teacher
City,,,,,,,,,,
Austin,NaN,149543.0,48063.0,71811.0,NaN,50180.0,102387.0,NaN,150695.0,54319.0
Charlotte,45547.0,NaN,86800.0,NaN,NaN,NaN,94314.0,199838.0,77557.0,NaN
Chicago,39087.0,NaN,NaN,NaN,64180.0,51397.0,80748.0,NaN,222360.0,53197.0
Columbus,NaN,150485.0,NaN,30977.0,47554.0,NaN,NaN,NaN,NaN,73547.0
Dallas,60977.0,NaN,NaN,80063.0,68133.0,NaN,94935.0,50738.0,152134.0,44969.0
Houston,NaN,52329.0,96749.0,NaN,54424.0,NaN,39575.0,74783.0,79810.0,70288.0
Indianapolis,31516.0,80466.0,NaN,NaN,97152.0,63499.0,60993.0,NaN,76965.0,NaN
Los Angeles,81429.0,282542.0,95970.0,53901.0,NaN,NaN,98899.0,NaN,NaN,NaN
New York,NaN,160022.0,NaN,59259.0,67217.0,NaN,NaN,152412.0,NaN,NaN
Philadelphia,NaN,NaN,94485.0,42407.0,89150.0,NaN,90919.0,61504.0,245544.0,98922.0
Phoenix,NaN,84433.0,NaN,62907.0,105211.0,38469.0,NaN,99057.0,85438.0,NaN
San Antonio,NaN,NaN,92603.0,31405.0,142213.0,NaN,65894.0,89292.0,45583.0,36944.0
San Diego,30695.0,45377.0,NaN,98516.0,NaN,NaN,63021.0,NaN,38910.0,NaN
San Jose,NaN,NaN,NaN,NaN,111338.0,NaN,NaN,78800.0,NaN,79157.0
Seattle,NaN,NaN,NaN,139902.0,51851.0,NaN,183932.0,NaN,61562.0,NaN

In [12]:
df.pivot_table(index='Age_Group',
              values='Age',
                columns='Occupation',
               aggfunc='count'             
              )

Occupation,Accountant,Architect,Artist,Doctor,Engineer,Journalist,Lawyer,Pilot,Scientist,Teacher
Age_Group,,,,,,,,,,
Group(20-30),NaN,7.0,2.0,2.0,5.0,2.0,5.0,4.0,2.0,2.0
Group(31-40),1.0,2.0,1.0,1.0,1.0,NaN,4.0,3.0,6.0,1.0
Group(41-50),1.0,4.0,1.0,6.0,2.0,1.0,2.0,2.0,3.0,3.0
Group(51-60),4.0,3.0,3.0,3.0,6.0,1.0,3.0,2.0,7.0,2.0

In [13]:
df.pivot_table(index='Age_Group',
              values='Salary',
                columns='Occupation',
               aggfunc='max'             
              )

Occupation,Accountant,Architect,Artist,Doctor,Engineer,Journalist,Lawyer,Pilot,Scientist,Teacher
Age_Group,,,,,,,,,,
Group(20-30),NaN,75545.0,96749.0,99727.0,97152.0,51397.0,94935.0,89292.0,65013.0,70288.0
Group(31-40),45547.0,88413.0,92603.0,71811.0,64180.0,NaN,90919.0,79368.0,95844.0,53197.0
Group(41-50),30695.0,77475.0,53984.0,80063.0,76564.0,63499.0,86750.0,99057.0,78023.0,98922.0
Group(51-60),81429.0,86800.0,94485.0,31405.0,89150.0,38469.0,97182.0,50738.0,79810.0,79157.0

In [16]:
df.pivot_table(index='Occupation',
               values='Salary',
               aggfunc=['count','min','max','mean','sum']
              )

            count    min    max          mean      sum
           Salary Salary Salary        Salary   Salary
Occupation
Accountant      6  30695  81429  48208.500000   289251
Architect      16  38532  88413  62824.812500  1005197
Artist          7  32816  96749  73524.285714   514670
Doctor         12  30977  99727  55929.000000   671148
Engineer       14  39138  97152  64173.071429   898423
Journalist      4  38469  63499  50886.250000   203545
Lawyer         14  39575  97182  69686.928571   975617
Pilot          11  33813  99057  73311.272727   806424
Scientist      18  38910  95844  68697.666667  1236558
Teacher         8  36944  98922  63917.875000   511343